{
  "backend/main.mo": "Motoko actor handling user profiles and camera repair job CRUD with access control checks.",
  "feature_evidence.json": "Feature evidence report linking a button‑style update to JobsDashboardPage.tsx with related components.",
  "frontend-file-summaries.txt": "List of frontend file paths with short descriptions for each component and page.",
  "frontend/index.css": "Tailwind base/theme configuration defining color variables for light and dark modes.",
  "frontend/index.html": "HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gate, app layout, and page routes.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication wrapper showing login screen or app content based on identity state.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and React Query cache reset.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter and save their name.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with header, login button, content region, and bottom navigation.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor and refreshing queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useJobs.ts": "React Query hooks for listing, fetching, creating, updating, and deleting repair jobs, plus managing the caller's user profile.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and utility classes for the frontend.",
  "frontend/src/main.tsx": "Application entry point initializing React, setting up QueryClientProvider and InternetIdentityProvider, and rendering the App component.",
  "frontend/src/pages/JobDetailsPage.tsx": "Page to display a single job's details with loading/error states and actions like edit and delete.",
  "frontend/src/pages/JobsDashboardPage.tsx": "Dashboard listing all jobs with search, filtering, stats, and navigation to job creation or details.",
  "frontend/src/pages/JobUpsertPage.tsx": "Form page for creating or editing a repair job, handling form state, validation, and submission.",
  "frontend/src/pages/SettingsPage.tsx": "React page showing app info and job statistics using data from useListJobs, with loading and error states.",
  "frontend/src/utils/jobFiltering.ts": "Provides a function to filter jobs by status and search text and sort them by jobId descending.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and layout settings with plugins for typography, container queries, and animations.",
  "project_state.json": "No summary available."
}